In [2]:
import pandas as pd

In [ ]:
#Conditional Filtering
'''
Single Condition Filter
Using And -> & 
Using between ( used in range values only like salary)
Using Or -> | 
Using isin
'''

In [5]:
df = pd.read_csv('Employees.csv')
df.head(10)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0
5,105,David,Austin,DAUSTIN,590.423.4569,25.06.2005,IT_PROG,4800,NaN,103.0,60.0
6,106,Valli,Pataballa,VPATABAL,590.423.4560,05.02.2006,IT_PROG,4800,NaN,103.0,60.0
7,107,Diana,Lorentz,DLORENTZ,590.423.5567,07.02.2007,IT_PROG,4200,NaN,103.0,60.0
8,108,Nancy,Greenberg,NGREENBE,515.124.4569,17.08.2002,FI_MGR,12008,NaN,101.0,100.0
9,109,Daniel,Faviet,DFAVIET,515.124.4169,16.08.2002,FI_ACCOUNT,9000,NaN,108.0,100.0

In [7]:
#1. Find the employees details who works under department 90.
depart_filter = df['DEPARTMENT_ID'] == 90
df[depart_filter]

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,NaN,100.0,90.0

In [18]:
#2. Find the details of employees whose salary is more than 5000 and less than 15000


sal_filter = (df['SALARY'] > 5000) & (df['SALARY'] < 15000)
df[sal_filter]

#Using between
sal_fil = df['SALARY'].between(5000,15000)  
df[sal_fil].head()

# When we use AND then it is exclusive 
# When we use between then it is inclusive

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0
8,108,Nancy,Greenberg,NGREENBE,515.124.4569,17.08.2002,FI_MGR,12008,NaN,101.0,100.0
9,109,Daniel,Faviet,DFAVIET,515.124.4169,16.08.2002,FI_ACCOUNT,9000,NaN,108.0,100.0
10,110,John,Chen,JCHEN,515.124.4269,28.09.2005,FI_ACCOUNT,8200,NaN,108.0,100.0

In [ ]:
#3. Find the employees details who has job id of IT_PROG or FI_ACCOUNT
job_filter = (df['JOB_ID'] == 'IT_PROG') | (df['JOB_ID'] == 'FI_ACCOUNT')
df[job_filter]

# Using isin
job_fil = df['JOB_ID'].isin(['IT_PROG','FI_ACCOUNT'])
df[job_fil].head(10)

#Why isin is more effcicient than or

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0
5,105,David,Austin,DAUSTIN,590.423.4569,25.06.2005,IT_PROG,4800,NaN,103.0,60.0
6,106,Valli,Pataballa,VPATABAL,590.423.4560,05.02.2006,IT_PROG,4800,NaN,103.0,60.0
7,107,Diana,Lorentz,DLORENTZ,590.423.5567,07.02.2007,IT_PROG,4200,NaN,103.0,60.0
9,109,Daniel,Faviet,DFAVIET,515.124.4169,16.08.2002,FI_ACCOUNT,9000,NaN,108.0,100.0
10,110,John,Chen,JCHEN,515.124.4269,28.09.2005,FI_ACCOUNT,8200,NaN,108.0,100.0
11,111,Ismael,Sciarra,ISCIARRA,515.124.4369,30.09.2005,FI_ACCOUNT,7700,NaN,108.0,100.0
12,112,Jose Manuel,Urman,JMURMAN,515.124.4469,07.03.2006,FI_ACCOUNT,7800,NaN,108.0,100.0
13,113,Luis,Popp,LPOPP,515.124.4567,07.12.2007,FI_ACCOUNT,6900,NaN,108.0,100.0

In [49]:
#importing dataset
df_hr = pd.read_csv("t.csv")
df_hr.head(10)

,Employee_Name,EmpID,MarriedID,MaritalStatusID,GenderID,EmpStatusID,DeptID,PerfScoreID,FromDiversityJobFairID,Salary,...,ManagerName,ManagerID,RecruitmentSource,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,LastPerformanceReview_Date,DaysLateLast30,Absences
0,"Adinolfi, Wilson K",10026,0,0,1,1,5,4,0,62506,...,Michael Albert,22.0,LinkedIn,Exceeds,4.60,5,0,17-01-2019,0,1
1,"Ait Sidi, Karthikeyan",10084,1,1,1,5,3,3,0,104437,...,Simon Roup,4.0,Indeed,Fully Meets,4.96,3,6,24-02-2016,0,17
2,"Akinkuolie, Sarah",10196,1,1,0,5,5,3,0,64955,...,Kissy Sullivan,20.0,LinkedIn,Fully Meets,3.02,3,0,15-05-2012,0,3
3,"Alagbe,Trina",10088,1,1,0,1,5,3,0,64991,...,Elijiah Gray,16.0,Indeed,Fully Meets,4.84,5,0,03-01-2019,0,15
4,"Anderson, Carol",10069,0,2,0,5,5,3,0,50825,...,Webster Butler,39.0,Google Search,Fully Meets,5.00,4,0,01-02-2016,0,2
5,"Anderson, Linda",10002,0,0,0,1,5,4,0,57568,...,Amy Dunn,11.0,LinkedIn,Exceeds,5.00,5,0,07-01-2019,0,15
6,"Andreola, Colby",10194,0,0,0,1,4,3,0,95660,...,Alex Sweetwater,10.0,LinkedIn,Fully Meets,3.04,3,4,02-01-2019,0,19
7,"Athwal, Sam",10062,0,4,1,1,5,3,0,59365,...,Ketsia Liebig,19.0,Employee Referral,Fully Meets,5.00,4,0,25-02-2019,0,19
8,"Bachiochi, Linda",10114,0,0,0,3,5,3,1,47837,...,Brannon Miller,12.0,Diversity Job Fair,Fully Meets,4.46,3,0,25-01-2019,0,4
9,"Bacong, Alejandro",10250,0,2,1,1,3,3,0,50178,...,Peter Monroe,7.0,Indeed,Fully Meets,5.00,5,6,18-02-2019,0,16

In [59]:
#1. Find details of the employees with the salary range of 50000 to 70000 and who are married
#2. Details of employees who works under productiona and their employment status is active as well
#3. Details of employees who works under IT/IS department and their absences record must be more than 8

#1.
emp_sal = (df_hr['Salary'].between(50000,70000)) & (df_hr['MaritalDesc'] == 'Married')
df_hr.loc[emp_sal,['Salary','MaritalDesc']]

     Salary MaritalDesc
2     64955     Married
3     64991     Married
10    54670     Married
21    64955     Married
22    64991     Married
..      ...         ...
558   64991     Married
566   64955     Married
567   64991     Married
575   64955     Married
576   64991     Married

[130 rows x 2 columns]

In [64]:
#2. Details of employees who works under productiona and their employment status is active as well
emp_pr_es = (df_hr['Department'] == 'Production       ') & (df_hr['EmploymentStatus'] == 'Active')
df_hr[emp_pr_es]

,Employee_Name,EmpID,MarriedID,MaritalStatusID,GenderID,EmpStatusID,DeptID,PerfScoreID,FromDiversityJobFairID,Salary,...,ManagerName,ManagerID,RecruitmentSource,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,LastPerformanceReview_Date,DaysLateLast30,Absences
0,"Adinolfi, Wilson K",10026,0,0,1,1,5,4,0,62506,...,Michael Albert,22.0,LinkedIn,Exceeds,4.60,5,0,17-01-2019,0,1
3,"Alagbe,Trina",10088,1,1,0,1,5,3,0,64991,...,Elijiah Gray,16.0,Indeed,Fully Meets,4.84,5,0,03-01-2019,0,15
5,"Anderson, Linda",10002,0,0,0,1,5,4,0,57568,...,Amy Dunn,11.0,LinkedIn,Exceeds,5.00,5,0,07-01-2019,0,15
7,"Athwal, Sam",10062,0,4,1,1,5,3,0,59365,...,Ketsia Liebig,19.0,Employee Referral,Fully Meets,5.00,4,0,25-02-2019,0,19
8,"Bachiochi, Linda",10114,0,0,0,3,5,3,1,47837,...,Brannon Miller,12.0,Diversity Job Fair,Fully Meets,4.46,3,0,25-01-2019,0,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
573,"Adinolfi, Wilson K",10026,0,0,1,1,5,4,0,62506,...,Michael Albert,22.0,LinkedIn,Exceeds,4.60,5,0,17-01-2019,0,1
576,"Alagbe,Trina",10088,1,1,0,1,5,3,0,64991,...,Elijiah Gray,16.0,Indeed,Fully Meets,4.84,5,0,03-01-2019,0,15
578,"Anderson, Linda",10002,0,0,0,1,5,4,0,57568,...,Amy Dunn,11.0,LinkedIn,Exceeds,5.00,5,0,07-01-2019,0,15
580,"Athwal, Sam",10062,0,4,1,1,5,3,0,59365,...,Ketsia Liebig,19.0,Employee Referral,Fully Meets,5.00,4,0,25-02-2019,0,19
581,"Bachiochi, Linda",10114,0,0,0,3,5,3,1,47837,...,Brannon Miller,12.0,Diversity Job Fair,Fully Meets,4.46,3,0,25-01-2019,0,4

In [65]:
 #3. Details of employees who works under IT/IS department and their absences record must be more than 8
emp_depart_abs = (df_hr['Department'].isin(['IT/IS'])) & (df_hr['Absences'] > 8)
df_hr.loc[emp_depart_abs, ['Department','Absences']].head(10)

    Department  Absences
1        IT/IS        17
9        IT/IS        16
12       IT/IS         9
20       IT/IS        17
28       IT/IS        16
31       IT/IS         9
80       IT/IS        19
89       IT/IS        15
94       IT/IS        16
115      IT/IS        15

In [ ]:
#Diff between query and code
# Data should be in between single quotation , not double